'use strict'

// Флаги
// i - ігнорує регістр*
// g - глобальний погук а не перший збіг*
// m - багатостроковий пошук*
// Класи
// \d - numbers 0-9*
// \D - not numbers*
// \w - word*
// \W - not word*
// \s - space*
// \S - not space*
// \b - word or symbol with spase around*
// \B - not word*
// [] - набір *
// - діапазон *
// ^ - в [] це виключення за межами набору це початок строки*
// {} - показник кількості*
// () - група символів*
//  + - один або більше
//  ? - нуль або один
//  * - нуль або більше
//  . - будь - який символ*
//  $ - кінець строки*

// ==========================================================================================
// let reg = new RegExp(win);

// let pattern = /win/;
// const string = 'text windows win';
// console.log(string.match(pattern)); // массив с результатами
// console.log(pattern.test(string)); // вернет правдв или ложь 
// ========================================================================

// let string = 'Is that all there is?',
//     reg = /is/gi; // фЛАГ g (global) выдаст массив со всеми is но без учета регистра, если большое то не поймет
//                   // фЛАГ i (ignore) игнорирует регистр
//                   // gi ig  не имеет разницы порядок, и так и так сработает
// console.log(string.match(reg));

// ====================================================================
// let string = '12345 , q5 wg w. www h - whwhwh',
//     reg = /\d/g,  // d - класс для поиска чисел, все числа в строке
//                   // g - флаг, всегла пишется после / закрытия регулярного выражения
//     number = /5/g;

// console.log(string.match(reg));
// console.log(string.match(number));

// ============================================================================
// let string = '12345 , q5 wg w. www h - whwhwh',
//     reg = /\D/g;  // d - класс для поиска всего кроме чисел
//                   // g - флаг, всегла пишется после / закрытия регулярного выражения
// console.log(string.match(reg));

// ===============================================================================
// let string = '12345 , q5 wg w. www h - whwhwh',
//     reg = /\w/g;  // w - класс для поиска всего (числе, букв) кроме спецсимволов (пробел , ; - = +)
//                   // g - флаг, всегла пишется после / закрытия регулярного выражения
// console.log(string.match(reg));

// ===================================================================================
// let string = '12345 , q5 wg w. www h - whwhwh',
//     reg = /\w/gi;  // w - класс для поиска всего (числе, букв) кроме спецсимволов (пробел , ; - = +)
//                   // g - флаг, всегла пишется после / закрытия регулярного выражения
// console.log(string.match(reg));

// ========================================================================================
// let string = '92345 123, 243 467 52 34 987 5',
//     regV = /\d{1,3}/g;  // d{1,3} - минимум и максимум 
// console.log(string.match(regV));

// ==============================================================================================
// let string = '92345 123, 243 467 52 34 987 5',
//     regV = /\d{3,}/g;  //  d{1,} - минимум и максимум хоть до бесконечности
//                        //  d{3,} - минимум и максимум хоть до бесконечности, поиск от трехзначных чисел и более
// console.log(string.match(regV));

// ======================================================================================================
// let string = '92345 123, 243 467 52 34 987 5',
//     regV = /\b\d{3}\b/g;  //  \b  - начало и конец слова, выделяет слово ищет пробелы
//                        //  /\b\d{3}\b/ - поиск только трехзначных чисел
// console.log(string.match(regV));

// =============================================================================================
// В ЕМЕЙЛЕ НЕ должно быть ничего кроме латинских букв и цифр
// let string = 'random text with a number - 5',
//     regV = /[a-zA-z0-9]/ig;  //[a-zA-z0-9] - квадратные скобки показывают что это набор
// console.log(string.match(regV));

// ==============================================================================================
// let string = 'random 1 text with a number 5 afafaf',
//     regV = /^\d{4}$/ig;  //  /^\d{4}$/  - проверка например пин для карты, только цифра из 4 чисел
//                         //   ^   - начало строки
//                         //  $  - конец строки
// console.log(string.match(regV));

// ================================================================================================
// let string = '22 random 1 text with a number 5;',
//     regV = /^\d{2}.{1,};$/ig;  //  . - любой один символ
// console.log(string.match(regV));

// ======================================================================================================
// let string = '22 random 1 text with a number 5;',
//     regV = /^\d{2}.{1,};$/ig;  //  \. - экранирование точки, поиск только точки
// console.log(string.match(regV));

// ======================================================================================================
//  \s - ищет чисто пробелы

// ===============================================================================================
// let string = 'The Car is parked in the garage parararar',
//     regV = /\b(c|g|p)[a-z]{1,}\b/gi;   // () - набор моих проверок которые нужно выполнить
//                                 //  |  - оператор или
//                                 // \b(c|g|p)ar\b - искать слова начинающиеся с (c или g или p) и заканчивается на (ar)
// console.log(string.match(regV));

// =====================================================================================================
// +   - это {1,}  его аналог просто
// ?  - символ может быть отстутсвующей или быть максимум одним {0,1}
// *  - символ может быть отстутсвующей или быть бесконечностью символов {0,}

// ==================================================================================================
// /\+\d{1,2}\(\d{2,3}\)\d{2,3}(\s|-)\d{2,3}(\s|-)\d{2,3}/g
// +8(054)789-98-45
// +4(01)789 52 12
// +78(111)78 98 852
// +1(1)1235-45-8
// +88(0214)12 25 21 3

// ===================================================================================================

// /\b\d{1,6}\.?\D{1,3}/g
// 45px
// 458.2rem
// 1.123647em
// asdas17px
// aa1245rem